# Load Data from Database Using SQL

In [7]:
import pandas as pd

from sqlalchemy import create_engine

In [10]:
# Connect to sqlite db
db_file = r'Module_0/datasets/gradedata.db'
engine = create_engine(r"sqlite:///{}".format(db_file))

In [14]:
#find out what tables are in the database
#sql = "SELECT name FROM sqlite_master WHERE type = 'table';"  # original query
sql = "SELECT * from sqlite_master;"
table_names = pd.read_sql(sql, engine)
table_names

,type,name,tbl_name,rootpage,sql
0,table,test,test,2,"CREATE TABLE ""test"" (\n""index"" INTEGER,\n ""Na..."
1,index,ix_test_index,test,3,"CREATE INDEX ""ix_test_index""ON ""test"" (""index"")"

In [12]:
#get all the rows from the "test" table in the database
sql = "SELECT * FROM test;"
sales_data_df = pd.read_sql(sql, engine)
sales_data_df

   index    Names  Grades
0      0      Bob      76
1      1  Jessica      95
2      2     Mary      77
3      3     John      78
4      4      Mel      99

In [13]:
#query with conditional
sql = 'SELECT * FROM test WHERE Grades IN (76,77,78)'

grades_df = pd.read_sql(sql, engine)
grades_df

   index Names  Grades
0      0   Bob      76
1      2  Mary      77
2      3  John      78